WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Ext_LCD/src/stm32f4xx_nucleo_ExtLCD.c
	SDA_MODE_OUT();
	CSX_HIGH();
	return value;
}

/**********************************************************
				   write color data
**********************************************************/
void WriteColor(uint16_t color)
{
	uint8_t Index;
	CSX_LOW();
	DCX_HIGH();

	for(Index = 0; Index < 16; Index ++)
	{
		if(color & 0x8000)
			SDA_HIGH();
		else
			SDA_LOW();
		color <<= 1;
		/* SDA is sampled at the rising edge of SCL */
		SCL_LOW();
		SCL_HIGH();
	}
	CSX_HIGH();
}

/**********************************************************
						write data
**********************************************************/
void WriteDAT(uint8_t value)
{
	uint8_t Index;
	CSX_LOW();
	DCX_HIGH();

	for(Index = 0; Index < 8; Index ++)
	{
		if(value & 0x80)
			SDA_HIGH();
		else
			SDA_LOW();
		value <<= 1;
		SCL_LOW();
		/* SDA is sampled at the rising edge of SCL */
		SCL_HIGH();
	}
	CSX_HIGH();
}

/**********************************************************
						write command
**********************************************************/
void WriteCOM(uint8_t value)
{
	uint8_t Index;
	CSX_LOW();
	DCX_LOW();

	for(Index = 0; Index < 8; Index ++)
	{
		if(value & 0x80)
			SDA_HIGH();
		else
			SDA_LOW();
		value <<= 1;
		/* SDA is sampled at the rising edge of SCL */
		SCL_LOW();
		SCL_HIGH();
	}
	CSX_HIGH();
}

/* Pin Map:
LED-  RST   A0(D/CX) SDA SCL  CS
PA15  RESET PC3      PC2 PB10 PB6
*/
/**
  * @brief  Configures LCD Control lines in geneal mode.
  * @param  None
  * @retval None
  */
void LCD_CtrlLinesConfig(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	LCD_CLK_ENABLE();
/*-- GPIO Configuration ------------------------------------------------------*/
	GPIO_InitStructure.Pin = SCL_PIN | CSX_PIN;
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
	GPIO_InitStructure.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(SCL, &GPIO_InitStructure);
	GPIO_InitStructure.Pin = SDA_PIN | DCX_PIN;
	HAL_GPIO_Init(SDA, &GPIO_InitStructure);
	GPIO_InitStructure.Pin = BK_LED_PIN;
	HAL_GPIO_Init(BK_LED, &GPIO_InitStructure);
	BK_LED_ON();
}

/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount)
{
	__IO uint32_t index = 0;
	for(index = (50000 * nCount); index != 0; index--)
	{
	}
}

#if (SUPPORTCHINESE == 1)

#if (FROMFAT == 1)
FRESULT fres;
UINT countbr;
FIL file;
#endif

/**
  * @简介  从存储介质中获取汉字编码
  * @参数  *pBuffer:用于存储汉字编码的数组
  *		   *c:汉字机内码,例如"储"
  * @返回  无
  */
void GetHzCode(unsigned char *pBuffer, const unsigned char *c)
{
	unsigned char High8bit,Low8bit;
	unsigned long pos;
	High8bit = *c;     /* 取高8位数据 */
	Low8bit = *(c+1);  /* 取低8位数据 */

	if(Low8bit < 0x7f)
		Low8bit -= 0x40;
	else
		Low8bit -= 0x41;
	High8bit -= 0x81;

	pos = ((unsigned long)190 * High8bit + Low8bit) * 32;

	#if (FROMFAT == 1)
		fres = f_open(&file , FilePath, FA_OPEN_EXISTING | FA_READ);
		if ( fres == FR_OK )
	    {
			f_lseek (&file, pos);
			fres = f_read( &file, pBuffer, 32, &countbr );
			f_close(&file);
	    }
	#else
		SPI_Flash_Read(pBuffer, FontADDRESS + pos, 32);
	#endif
}

/**
  *	@简介  根据汉字点阵数据数组显示汉字
  *	@参数  x:起始横坐标
  *		   y:起始纵坐标
  *        *str:汉字点阵数据数组
  *		   tcolor:字体颜色
  *		   bcolor:字体背景色
  *	@返回  无
  */
void LCD_Write_Char(uint8_t x, uint8_t y, const uint8_t *str, uint16_t tcolor, uint16_t bcolor)
{
	uint8_t table[32];
	uint8_t i, j;
	uint16_t tmp_char = 0;
	GetHzCode(table, str);
	LCD_SetRamAddr(x, x + 15, y, y + 15);
	for(i = 0; i < 16; i ++)
	{
		tmp_char=table[i*2];
		tmp_char=(tmp_char<<8);
		tmp_char|=table[2*i+1];
		for(j = 0; j < 16; j++)
		{
			if( (tmp_char>>15-j) & 0x01 == 0x01)
			{
				WriteColor(tcolor);
			}
			else
			{
				WriteColor(bcolor);
			}
		}
		y++;
	}
}

/**
  *	@简介  根据汉字点阵数据数组"悬浮"显示汉字
  *	@参数  x:起始横坐标
  *		   y:起始纵坐标
  *        *str:汉字点阵数据数组
  *		   tcolor:字体颜色
  *	@返回  无
  */
void LCD_Write_Char_On(uint8_t x, uint8_t y,const uint8_t *str, uint16_t tcolor)
{
	uint8_t table[32];
	uint8_t i, j;
	uint16_t tmp_char = 0;
	GetHzCode(table, str);
	for(i = 0; i < 16; i ++)
	{
		tmp_char=table[i*2];
		tmp_char=(tmp_char<<8);
		tmp_char|=table[2*i+1];
		for(j = 0; j < 16; j++)
		{
			if((tmp_char>>15-j) & 0x01 == 0x01)
			{
				DrawPiont(x + j, y + i, tcolor);
			}
		}
	}
}

/**
  *	@简介  显示纯汉字字符串(支持自动换行)
  * @参数  x:起始横坐标
  *		   y:起始纵坐标
  *		   *str:字符串数组
  *		   tcolor:字符串颜色
  *		   bcolor:字符串背景色
  *	@返回  无
  */
void LCD_CHINESE_STR(uint8_t x, uint8_t y, const uint8_t *str, uint16_t tcolor, uint16_t bcolor)
{
	while(*str != '\0')
	{
		LCD_Write_Char(x, y, str, tcolor, bcolor);
		str += 2;
		x += 16;
		if(x >= LCD_PIXEL_WIDTH)
		{
			y += 16;
			x = 0;
		}
	}
}

/**
  *	@简介  显示纯汉字字符串(支持自动换行)
  * @参数  x:起始横坐标
  *		   y:起始纵坐标
  *		   *str:字符串数组
  *		   tcolor:字符串颜色
  *	@返回  无
  */
void LCD_CHINESE_STR_ON(uint8_t x, uint8_t y, const uint8_t *str, uint16_t tcolor)
{
	while(*str != '\0')
	{
		LCD_Write_Char_On(x, y, str, tcolor);
		str += 2;
		x += 16;
		if(x >= LCD_PIXEL_WIDTH)
		{
			y += 16;
			x = 0;
		}
	}
}

/**
  * @简介  显示任意字符串
  * @参数  x:起始横坐标
  *		   y:起始纵坐标
  *		   *str:字符串数组
  *		   tcolor:字符串颜色
  *		   bcolor:字符串背景色
  * @返回  无
  */
void LCD_STRING(uint8_t x, uint8_t y, const uint8_t *str, uint16_t tcolor, uint16_t bcolor)
{
	while(*str != 0)
	{
		if(*str > 0x80)
		{
			if(x + 16 > LCD_PIXEL_WIDTH)
			{
				y += 16;
				x = 0;
			}
			LCD_Write_Char(x,y,str,tcolor,bcolor);
			str += 2;
			x += 16;
		}
		else
		{	
			if((x + 8 > LCD_PIXEL_WIDTH) || (*str == '\n') || (*str == '\r'))
			{
				y += 16;
				x = 0;
			}
			if((*str != '\n') && (*str != '\r'))
			{
				DrawCharacter(x, y, *str, tcolor, bcolor);
				x += 8;
			}
			str ++;
		}
	}
}

/**
  * @简介  显示任意"悬浮"字符串
  * @参数  x:起始横坐标
  *		   y:起始纵坐标
  *		   *str:字符串数组
  *		   tcolor:字符串颜色
  * @返回  无
  */
void LCD_STRING_ON(uint8_t x, uint8_t y,const uint8_t *str, uint16_t tcolor)
{
	while(*str != 0)
	{
		if(*str > 0x80)
		{	
			if(x + 16 > LCD_PIXEL_WIDTH)
			{
				y += 16;
				x = 0;
			}
			LCD_Write_Char_On(x,y,str,tcolor);
			str += 2;
			x += 16;
		}
		else
		{	
			if((x + 8 > LCD_PIXEL_WIDTH) || (*str == '\n') || (*str == '\r'))
			{
				y += 16;
				x = 0;
			}
			if((*str != '\n') && (*str != '\r'))
			{
				DrawCharacter_On(x, y, *str, tcolor);
				x += 8;
			}
			str ++;
		}
	}
}

/**
  * @简介  显示8*16的ASCII字符
  * @参数  x:起始横坐标
  *		   y:起始纵坐标
  *		   ascii:要显示的ASCII字符
  *		   tcolor:字符串颜色
  *		   bcolor:字符串背景色
  * @返回  无
  */
void DrawCharacter(uint8_t x, uint8_t y, uint8_t ascii, uint16_t tcolor, uint16_t bcolor)
{
	uint8_t i,j;
	uint16_t adr;
	ascii -= 32;
	adr = ascii * 16;
	LCD_SetRamAddr(x, x + 7, y, y + 15);
	for(i = 0; i < 16; i ++)
	{
		for(j = 0; j < 8; j++)
		{
			if(((ASCII8x16_Table[adr]>>(7-j)) & 0x01) == 0x01)
			{
				WriteColor(tcolor);
			}
			else
			{
				WriteColor(bcolor);
			}
		}
		y ++;
		adr ++;
	}
}

/**
  * @简介  显示8*16的"悬浮"ASCII字符
  * @参数  x:起始横坐标
  *		   y:起始纵坐标
  *		   ascii:要显示的ASCII字符
  *		   tcolor:字符串颜色
  * @返回  无
  */
void DrawCharacter_On(uint8_t x, uint8_t y, uint8_t ascii, uint16_t tcolor)
{
	uint8_t i,j;
	uint16_t adr;
	ascii -= 32;
	adr = ascii * 16;
	for(i=0;i<16;i++)
	{
		for(j = 0; j < 8; j++)
		{
			if(((ASCII8x16_Table[adr]>>(7-j)) & 0x01) == 0x01)
			{
				DrawPiont(x + j, y + i, tcolor);
			}
		}
		adr ++;
	}
}

#endif

/**	
  * @brief  支持图片解码
  */
#if (PICDECODE == 1)

	FRESULT bmpres;
	FIL bmpfile;
	uint16_t nubr;

#define GETRGB_R(RGB) ((unsigned char)(( ((unsigned short int )RGB) >>11)<<3))
#define GETRGB_G(RGB) ((unsigned char)(( ((unsigned short int )(RGB & 0x7ff)) >>5)<<2))
#define GETRGB_B(RGB) ((unsigned char)(( ((unsigned short int )(RGB & 0x1f))<<3)))
#define RGB24TO16(R,G,B) ((unsigned short int)((((R)>>3)<<11) | (((G)>>2)<<5) | ((B)>>3) ))
/* 对于24位真彩色 每一行的像素宽度必须为4的倍数 否则以0补齐 */
#define WIDTHBYTES(bits) (((bits)+31)/32*4)

BITMAPFILEHEADER LoadBmpHeader(uint8_t *data)
{
	BITMAPFILEHEADER bmpheader;
	bmpheader.bfType		 = 	(data[0]<<8) | data[1];
	bmpheader.bfSize 		 = 	(data[5]<<24) | (data[4]<<16) | (data[3]<<8) | data[2];
	bmpheader.bfOffBits 	 = 	(data[13]<<24) | (data[12]<<16) | (data[11]<<8) | data[10];
	return bmpheader ;
}

BITMAPINFOHEADER LoadBmpInfor(uint8_t *data)
{
	BITMAPINFOHEADER bmpinfor;
	bmpinfor.biSize		 	 = 	(data[17]<<24) | (data[16]<<16) | (data[15]<<8) | data[14];
	bmpinfor.biWidth	 	 = 	(data[21]<<24) | (data[20]<<16) | (data[19]<<8) | data[18];
	bmpinfor.biHeight	 	 = 	(data[25]<<24) | (data[24]<<16) | (data[23]<<8) | data[22];
	bmpinfor.biPlanes 	 	 = 	(data[27]<<8) | data[26];
	bmpinfor.biBitCount	 	 = 	(data[29]<<8) | data[28];
	bmpinfor.biCompression 	 = 	(data[33]<<24) | (data[32]<<16) | (data[31]<<8) | data[30];
	bmpinfor.biSizeImage 	 = 	(data[37]<<24) | (data[36]<<16) | (data[35]<<8) | data[34];
	bmpinfor.biXPelsPerMeter = 	(data[41]<<24) | (data[40]<<16) | (data[39]<<8) | data[38];
	bmpinfor.biYPelsPerMeter = 	(data[45]<<24) | (data[44]<<16) | (data[43]<<8) | data[42];
	bmpinfor.biClrUsed 		 = 	(data[49]<<24) | (data[48]<<16) | (data[47]<<8) | data[46];
	bmpinfor.biClrImportant  = 	(data[53]<<24) | (data[52]<<16) | (data[51]<<8) | data[50];
	return bmpinfor;
}	

unsigned char linebuffer[4 * 320];
uint8_t data[sizeof(BITMAPFILEHEADER) + sizeof(BITMAPINFOHEADER)];

/**
  * @brief  Display BMP File
  * @param  (x,y):position
  * @param  path
  * @retval Display state
  */
uint8_t Show_BMP(uint8_t x, uint8_t y, char *path)
{
	BITMAPFILEHEADER bmpheader;
	BITMAPINFOHEADER bmpinfor;
	unsigned long indexx, indexy, width, height;
	unsigned int numdatwidth;
	/* open file */
	bmpres = f_open(&bmpfile, (char *)path, FA_OPEN_EXISTING | FA_READ);
	if(bmpres != FR_OK)
	{
        LCD_SetTextColor(LCD_COLOR_RED);
		LCD_DisplayStringLine(LCD_LINE_0, (uint8_t *)"File Error!     ");
		LCD_SetTextColor(LCD_COLOR_BLACK);
		f_close(&bmpfile);
		return 1;
	}
	/* read file header */
	bmpres = f_read(&bmpfile, data, (sizeof(BITMAPFILEHEADER) + sizeof(BITMAPINFOHEADER)), (void *)&nubr);
	if(bmpres != FR_OK)
	{
        LCD_SetTextColor(LCD_COLOR_RED);
		LCD_DisplayStringLine(LCD_LINE_0, (uint8_t *)"Header Error!   ");
		LCD_SetTextColor(LCD_COLOR_BLACK);
		f_close(&bmpfile);
		return 1;
	}
	/* analytial data */
	bmpheader = LoadBmpHeader(data);
	bmpinfor = LoadBmpInfor(data);
	if(bmpheader.bfType != 0x424d)
	{
		LCD_SetTextColor(LCD_COLOR_RED);
		LCD_DisplayStringLine(LCD_LINE_0, (uint8_t *)"Type Error!     ");
		LCD_SetTextColor(LCD_COLOR_BLACK);
		f_close(&bmpfile);
		return 1;
	}
	width = bmpinfor.biWidth;
	height = bmpinfor.biHeight;
	if((width > LCD_PIXEL_WIDTH) || (height > LCD_PIXEL_HEIGHT))
	{
		LCD_SetTextColor(LCD_COLOR_RED);
		LCD_DisplayStringLine(LCD_LINE_0, (uint8_t *)"Size Error!     ");
		LCD_SetTextColor(LCD_COLOR_BLACK);
		f_close(&bmpfile);
		return 1;
	}
	numdatwidth = WIDTHBYTES(width * (bmpinfor.biBitCount));
	y += (height - 1);
	/* fixed position */
	f_lseek(&bmpfile, bmpheader.bfOffBits);
	for(indexy = 0; indexy < height; indexy ++)
	{
		LCD_SetRamAddr(x, x + bmpinfor.biWidth - 1, y, y);
		f_read(&bmpfile, linebuffer, numdatwidth, (void *)&nubr);
		for(indexx = 0; indexx < width; indexx ++)
		{
			WriteColor(RGB24TO16(linebuffer[indexx * 3 + 2], \
				linebuffer[indexx * 3 + 1], linebuffer[indexx * 3]));
		}
		y --;
	}
	f_close(&bmpfile);
	return 0;
}

#endif

/*************************************** END OF FILE ***************************************/
